espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_fpb.h
/******************************************************************************
*  Filename:       hw_cpu_fpb_h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_CPU_FPB_H__
#define __HW_CPU_FPB_H__

//*****************************************************************************
//
// This section defines the register offsets of
// CPU_FPB component
//
//*****************************************************************************
// Provides FPB implementation information, and the global enable for the FPB
// unit
#define CPU_FPB_O_CTRL                                              0x00000000

// Indicates whether the implementation supports Flash Patch remap and, if it
// does, holds the target address for remap
#define CPU_FPB_O_REMAP                                             0x00000004

// Holds an address for comparison. The effect of the match depends on the
// configuration of the FPB and whether the comparator is an instruction
// address comparator or a literal address comparator
#define CPU_FPB_O_COMP0                                             0x00000008

// Holds an address for comparison. The effect of the match depends on the
// configuration of the FPB and whether the comparator is an instruction
// address comparator or a literal address comparator
#define CPU_FPB_O_COMP1                                             0x0000000C

// Holds an address for comparison. The effect of the match depends on the
// configuration of the FPB and whether the comparator is an instruction
// address comparator or a literal address comparator
#define CPU_FPB_O_COMP2                                             0x00000010

// Holds an address for comparison. The effect of the match depends on the
// configuration of the FPB and whether the comparator is an instruction
// address comparator or a literal address comparator
#define CPU_FPB_O_COMP3                                             0x00000014

// Holds an address for comparison. The effect of the match depends on the
// configuration of the FPB and whether the comparator is an instruction
// address comparator or a literal address comparator
#define CPU_FPB_O_COMP4                                             0x00000018

// Holds an address for comparison. The effect of the match depends on the
// configuration of the FPB and whether the comparator is an instruction
// address comparator or a literal address comparator
#define CPU_FPB_O_COMP5                                             0x0000001C

// Holds an address for comparison. The effect of the match depends on the
// configuration of the FPB and whether the comparator is an instruction
// address comparator or a literal address comparator
#define CPU_FPB_O_COMP6                                             0x00000020

// Holds an address for comparison. The effect of the match depends on the
// configuration of the FPB and whether the comparator is an instruction
// address comparator or a literal address comparator
#define CPU_FPB_O_COMP7                                             0x00000024

// Provides CoreSight discovery information for the FPB
#define CPU_FPB_O_DEVARCH                                           0x00000FBC

// Provides CoreSight discovery information for the FPB
#define CPU_FPB_O_DEVTYPE                                           0x00000FCC

// Provides CoreSight discovery information for the FP
#define CPU_FPB_O_PIDR4                                             0x00000FD0

// Provides CoreSight discovery information for the FP
#define CPU_FPB_O_PIDR5                                             0x00000FD4

// Provides CoreSight discovery information for the FP
#define CPU_FPB_O_PIDR6                                             0x00000FD8

// Provides CoreSight discovery information for the FP
#define CPU_FPB_O_PIDR7                                             0x00000FDC

// Provides CoreSight discovery information for the FP
#define CPU_FPB_O_PIDR0                                             0x00000FE0

// Provides CoreSight discovery information for the FP
#define CPU_FPB_O_PIDR1                                             0x00000FE4

// Provides CoreSight discovery information for the FP
#define CPU_FPB_O_PIDR2                                             0x00000FE8

// Provides CoreSight discovery information for the FP
#define CPU_FPB_O_PIDR3                                             0x00000FEC

// Provides CoreSight discovery information for the FP
#define CPU_FPB_O_CIDR0                                             0x00000FF0

// Provides CoreSight discovery information for the FP
#define CPU_FPB_O_CIDR1                                             0x00000FF4

// Provides CoreSight discovery information for the FP
#define CPU_FPB_O_CIDR2                                             0x00000FF8

// Provides CoreSight discovery information for the FP
#define CPU_FPB_O_CIDR3                                             0x00000FFC

//*****************************************************************************
//
// Register: CPU_FPB_O_CTRL
//
//*****************************************************************************
// Field: [31:28] REV
//
// Flash Patch and Breakpoint Unit architecture revision
#define CPU_FPB_CTRL_REV_W                                                   4
#define CPU_FPB_CTRL_REV_M                                          0xF0000000
#define CPU_FPB_CTRL_REV_S                                                  28

// Field: [14:12] NUM_CODE_14_12_
//
// Indicates the number of implemented instruction address comparators. Zero
// indicates no Instruction Address comparators are implemented. The
// Instruction Address comparators are numbered from 0 to NUM_CODE - 1
#define CPU_FPB_CTRL_NUM_CODE_14_12__W                                       3
#define CPU_FPB_CTRL_NUM_CODE_14_12__M                              0x00007000
#define CPU_FPB_CTRL_NUM_CODE_14_12__S                                      12

