espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_fpb.h
// Field:  [11:8] NUM_LIT
//
// Indicates the number of implemented literal address comparators. The Literal
// Address comparators are numbered from NUM_CODE to NUM_CODE + NUM_LIT - 1
#define CPU_FPB_CTRL_NUM_LIT_W                                               4
#define CPU_FPB_CTRL_NUM_LIT_M                                      0x00000F00
#define CPU_FPB_CTRL_NUM_LIT_S                                               8

// Field:   [7:4] NUM_CODE_7_4_
//
// Indicates the number of implemented instruction address comparators. Zero
// indicates no Instruction Address comparators are implemented. The
// Instruction Address comparators are numbered from 0 to NUM_CODE - 1
#define CPU_FPB_CTRL_NUM_CODE_7_4__W                                         4
#define CPU_FPB_CTRL_NUM_CODE_7_4__M                                0x000000F0
#define CPU_FPB_CTRL_NUM_CODE_7_4__S                                         4

// Field:     [1] KEY
//
// Writes to the FP_CTRL are ignored unless KEY is concurrently written to one
#define CPU_FPB_CTRL_KEY                                            0x00000002
#define CPU_FPB_CTRL_KEY_BITN                                                1
#define CPU_FPB_CTRL_KEY_M                                          0x00000002
#define CPU_FPB_CTRL_KEY_S                                                   1

// Field:     [0] ENABLE
//
// Enables the FPB
#define CPU_FPB_CTRL_ENABLE                                         0x00000001
#define CPU_FPB_CTRL_ENABLE_BITN                                             0
#define CPU_FPB_CTRL_ENABLE_M                                       0x00000001
#define CPU_FPB_CTRL_ENABLE_S                                                0

//*****************************************************************************
//
// Register: CPU_FPB_O_REMAP
//
//*****************************************************************************
// Field:    [29] RMPSPT
//
// Indicates whether the FPB unit supports the Flash Patch remap function
#define CPU_FPB_REMAP_RMPSPT                                        0x20000000
#define CPU_FPB_REMAP_RMPSPT_BITN                                           29
#define CPU_FPB_REMAP_RMPSPT_M                                      0x20000000
#define CPU_FPB_REMAP_RMPSPT_S                                              29

// Field:  [28:5] REMAP
//
// Holds the bits[28:5] of the Flash Patch remap address
#define CPU_FPB_REMAP_REMAP_W                                               24
#define CPU_FPB_REMAP_REMAP_M                                       0x1FFFFFE0
#define CPU_FPB_REMAP_REMAP_S                                                5

//*****************************************************************************
//
// Register: CPU_FPB_O_COMP0
//
//*****************************************************************************
// Field:     [0] BE
//
// Selects between flashpatch and breakpoint functionality
#define CPU_FPB_COMP0_BE                                            0x00000001
#define CPU_FPB_COMP0_BE_BITN                                                0
#define CPU_FPB_COMP0_BE_M                                          0x00000001
#define CPU_FPB_COMP0_BE_S                                                   0

//*****************************************************************************
//
// Register: CPU_FPB_O_COMP1
//
//*****************************************************************************
// Field:     [0] BE
//
// Selects between flashpatch and breakpoint functionality
#define CPU_FPB_COMP1_BE                                            0x00000001
#define CPU_FPB_COMP1_BE_BITN                                                0
#define CPU_FPB_COMP1_BE_M                                          0x00000001
#define CPU_FPB_COMP1_BE_S                                                   0

//*****************************************************************************
//
// Register: CPU_FPB_O_COMP2
//
//*****************************************************************************
// Field:     [0] BE
//
// Selects between flashpatch and breakpoint functionality
#define CPU_FPB_COMP2_BE                                            0x00000001
#define CPU_FPB_COMP2_BE_BITN                                                0
#define CPU_FPB_COMP2_BE_M                                          0x00000001
#define CPU_FPB_COMP2_BE_S                                                   0

//*****************************************************************************
//
// Register: CPU_FPB_O_COMP3
//
//*****************************************************************************
// Field:     [0] BE
//
// Selects between flashpatch and breakpoint functionality
#define CPU_FPB_COMP3_BE                                            0x00000001
#define CPU_FPB_COMP3_BE_BITN                                                0
#define CPU_FPB_COMP3_BE_M                                          0x00000001
#define CPU_FPB_COMP3_BE_S                                                   0

//*****************************************************************************
//
// Register: CPU_FPB_O_COMP4
//
//*****************************************************************************
// Field:     [0] BE
//
// Selects between flashpatch and breakpoint functionality
#define CPU_FPB_COMP4_BE                                            0x00000001
#define CPU_FPB_COMP4_BE_BITN                                                0
#define CPU_FPB_COMP4_BE_M                                          0x00000001
#define CPU_FPB_COMP4_BE_S                                                   0

//*****************************************************************************
//
// Register: CPU_FPB_O_COMP5
//
//*****************************************************************************
// Field:     [0] BE
//
// Selects between flashpatch and breakpoint functionality
#define CPU_FPB_COMP5_BE                                            0x00000001
#define CPU_FPB_COMP5_BE_BITN                                                0
#define CPU_FPB_COMP5_BE_M                                          0x00000001
#define CPU_FPB_COMP5_BE_S                                                   0

//*****************************************************************************
//
// Register: CPU_FPB_O_COMP6
//
//*****************************************************************************
// Field:     [0] BE
//
// Selects between flashpatch and breakpoint functionality
#define CPU_FPB_COMP6_BE                                            0x00000001
#define CPU_FPB_COMP6_BE_BITN                                                0
#define CPU_FPB_COMP6_BE_M                                          0x00000001
#define CPU_FPB_COMP6_BE_S                                                   0

//*****************************************************************************
//
// Register: CPU_FPB_O_COMP7
//
//*****************************************************************************
// Field:     [0] BE
//
// Selects between flashpatch and breakpoint functionality
#define CPU_FPB_COMP7_BE                                            0x00000001
#define CPU_FPB_COMP7_BE_BITN                                                0
#define CPU_FPB_COMP7_BE_M                                          0x00000001
#define CPU_FPB_COMP7_BE_S                                                   0

//*****************************************************************************
//
// Register: CPU_FPB_O_DEVARCH
//
//*****************************************************************************
// Field: [31:21] ARCHITECT
//
// Defines the architect of the component. Bits [31:28] are the JEP106
// continuation code (JEP106 bank ID, minus 1) and bits [27:21] are the JEP106
// ID code.
#define CPU_FPB_DEVARCH_ARCHITECT_W                                         11
#define CPU_FPB_DEVARCH_ARCHITECT_M                                 0xFFE00000
#define CPU_FPB_DEVARCH_ARCHITECT_S                                         21

// Field:    [20] PRESENT
//
// Defines that the DEVARCH register is present
#define CPU_FPB_DEVARCH_PRESENT                                     0x00100000
#define CPU_FPB_DEVARCH_PRESENT_BITN                                        20
#define CPU_FPB_DEVARCH_PRESENT_M                                   0x00100000
#define CPU_FPB_DEVARCH_PRESENT_S                                           20

