espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_fpb.h
// Field: [19:16] REVISION
//
// Defines the architecture revision of the component
#define CPU_FPB_DEVARCH_REVISION_W                                           4
#define CPU_FPB_DEVARCH_REVISION_M                                  0x000F0000
#define CPU_FPB_DEVARCH_REVISION_S                                          16

// Field: [15:12] ARCHVER
//
// Defines the architecture version of the component
#define CPU_FPB_DEVARCH_ARCHVER_W                                            4
#define CPU_FPB_DEVARCH_ARCHVER_M                                   0x0000F000
#define CPU_FPB_DEVARCH_ARCHVER_S                                           12

// Field:  [11:0] ARCHPART
//
// Defines the architecture of the component
#define CPU_FPB_DEVARCH_ARCHPART_W                                          12
#define CPU_FPB_DEVARCH_ARCHPART_M                                  0x00000FFF
#define CPU_FPB_DEVARCH_ARCHPART_S                                           0

//*****************************************************************************
//
// Register: CPU_FPB_O_DEVTYPE
//
//*****************************************************************************
// Field:   [7:4] SUB
//
// Component sub-type
#define CPU_FPB_DEVTYPE_SUB_W                                                4
#define CPU_FPB_DEVTYPE_SUB_M                                       0x000000F0
#define CPU_FPB_DEVTYPE_SUB_S                                                4

// Field:   [3:0] MAJOR
//
// Component major type
#define CPU_FPB_DEVTYPE_MAJOR_W                                              4
#define CPU_FPB_DEVTYPE_MAJOR_M                                     0x0000000F
#define CPU_FPB_DEVTYPE_MAJOR_S                                              0

//*****************************************************************************
//
// Register: CPU_FPB_O_PIDR4
//
//*****************************************************************************
// Field:   [7:4] SIZE
//
// See CoreSight Architecture Specification
#define CPU_FPB_PIDR4_SIZE_W                                                 4
#define CPU_FPB_PIDR4_SIZE_M                                        0x000000F0
#define CPU_FPB_PIDR4_SIZE_S                                                 4

// Field:   [3:0] DES_2
//
// See CoreSight Architecture Specification
#define CPU_FPB_PIDR4_DES_2_W                                                4
#define CPU_FPB_PIDR4_DES_2_M                                       0x0000000F
#define CPU_FPB_PIDR4_DES_2_S                                                0

//*****************************************************************************
//
// Register: CPU_FPB_O_PIDR5
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_FPB_O_PIDR6
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_FPB_O_PIDR7
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_FPB_O_PIDR0
//
//*****************************************************************************
// Field:   [7:0] PART_0
//
// See CoreSight Architecture Specification
#define CPU_FPB_PIDR0_PART_0_W                                               8
#define CPU_FPB_PIDR0_PART_0_M                                      0x000000FF
#define CPU_FPB_PIDR0_PART_0_S                                               0

//*****************************************************************************
//
// Register: CPU_FPB_O_PIDR1
//
//*****************************************************************************
// Field:   [7:4] DES_0
//
// See CoreSight Architecture Specification
#define CPU_FPB_PIDR1_DES_0_W                                                4
#define CPU_FPB_PIDR1_DES_0_M                                       0x000000F0
#define CPU_FPB_PIDR1_DES_0_S                                                4

// Field:   [3:0] PART_1
//
// See CoreSight Architecture Specification
#define CPU_FPB_PIDR1_PART_1_W                                               4
#define CPU_FPB_PIDR1_PART_1_M                                      0x0000000F
#define CPU_FPB_PIDR1_PART_1_S                                               0

//*****************************************************************************
//
// Register: CPU_FPB_O_PIDR2
//
//*****************************************************************************
// Field:   [7:4] REVISION
//
// See CoreSight Architecture Specification
#define CPU_FPB_PIDR2_REVISION_W                                             4
#define CPU_FPB_PIDR2_REVISION_M                                    0x000000F0
#define CPU_FPB_PIDR2_REVISION_S                                             4

// Field:     [3] JEDEC
//
// See CoreSight Architecture Specification
#define CPU_FPB_PIDR2_JEDEC                                         0x00000008
#define CPU_FPB_PIDR2_JEDEC_BITN                                             3
#define CPU_FPB_PIDR2_JEDEC_M                                       0x00000008
#define CPU_FPB_PIDR2_JEDEC_S                                                3

// Field:   [2:0] DES_1
//
// See CoreSight Architecture Specification
#define CPU_FPB_PIDR2_DES_1_W                                                3
#define CPU_FPB_PIDR2_DES_1_M                                       0x00000007
#define CPU_FPB_PIDR2_DES_1_S                                                0

//*****************************************************************************
//
// Register: CPU_FPB_O_PIDR3
//
//*****************************************************************************
// Field:   [7:4] REVAND
//
// See CoreSight Architecture Specification
#define CPU_FPB_PIDR3_REVAND_W                                               4
#define CPU_FPB_PIDR3_REVAND_M                                      0x000000F0
#define CPU_FPB_PIDR3_REVAND_S                                               4

// Field:   [3:0] CMOD
//
// See CoreSight Architecture Specification
#define CPU_FPB_PIDR3_CMOD_W                                                 4
#define CPU_FPB_PIDR3_CMOD_M                                        0x0000000F
#define CPU_FPB_PIDR3_CMOD_S                                                 0

//*****************************************************************************
//
// Register: CPU_FPB_O_CIDR0
//
//*****************************************************************************
// Field:   [7:0] PRMBL_0
//
// See CoreSight Architecture Specification
#define CPU_FPB_CIDR0_PRMBL_0_W                                              8
#define CPU_FPB_CIDR0_PRMBL_0_M                                     0x000000FF
#define CPU_FPB_CIDR0_PRMBL_0_S                                              0

//*****************************************************************************
//
// Register: CPU_FPB_O_CIDR1
//
//*****************************************************************************
// Field:   [7:4] CLASS
//
// See CoreSight Architecture Specification
#define CPU_FPB_CIDR1_CLASS_W                                                4
#define CPU_FPB_CIDR1_CLASS_M                                       0x000000F0
#define CPU_FPB_CIDR1_CLASS_S                                                4

// Field:   [3:0] PRMBL_1
//
// See CoreSight Architecture Specification
#define CPU_FPB_CIDR1_PRMBL_1_W                                              4
#define CPU_FPB_CIDR1_PRMBL_1_M                                     0x0000000F
#define CPU_FPB_CIDR1_PRMBL_1_S                                              0

//*****************************************************************************
//
// Register: CPU_FPB_O_CIDR2
//
//*****************************************************************************
// Field:   [7:0] PRMBL_2
//
// See CoreSight Architecture Specification
#define CPU_FPB_CIDR2_PRMBL_2_W                                              8
#define CPU_FPB_CIDR2_PRMBL_2_M                                     0x000000FF
#define CPU_FPB_CIDR2_PRMBL_2_S                                              0

//*****************************************************************************
//
// Register: CPU_FPB_O_CIDR3
//
//*****************************************************************************
// Field:   [7:0] PRMBL_3
//
// See CoreSight Architecture Specification
#define CPU_FPB_CIDR3_PRMBL_3_W                                              8
#define CPU_FPB_CIDR3_PRMBL_3_M                                     0x000000FF
#define CPU_FPB_CIDR3_PRMBL_3_S                                              0


#endif // __CPU_FPB__
